// index.js
// 获取应用实例
const app = getApp()

Page({
  data: {
    timer: 9999,
    value: 'linex_tjt',
    list: [{
        value: 'index',
        label: '10号线 快七星岗',
        icon: 'home'
      },
      {
        value: 'line10_w',
        label: '10号线 快王家庄',
        icon: 'app'
      },
      {
        value: 'linex_td',
        label: '4/环/5 直跳蹬',
        icon: 'app'
      },
      {
        value: 'linex_tjt',
        label: '5/环/4 直唐家沱',
        icon: 'app'
      },
    ],
    stations: {
      'station_0': {
        'name': '跳蹬',
        'next': '',
        'times': [
          '06:45',
          '07:15',
          '07:45',
          '08:15',
          '08:45',
          '09:15',
          '09:45',
          '10:15',
          '10:45',
          '11:15',
          '11:45',
          '12:15',
          '12:45',
          '13:15',
          '13:45',
          '14:15',
          '14:45',
          '15:15',
          '15:45',
          '16:15',
          '16:45',
          '17:15',
          '17:45',
          '18:15',
          '18:45',
          '19:15'
        ],
      },
      'station_1': {
        'name': '华岩中心',
        'times': [
          '06:49',
          '07:19',
          '07:49',
          '08:18',
          '08:48',
          '09:18',
          '09:48',
          '10:18',
          '10:48',
          '11:18',
          '11:48',
          '12:18',
          '12:48',
          '13:18',
          '13:52',
          '14:18',
          '14:48',
          '15:18',
          '15:48',
          '16:18',
          '16:48',
          '17:18',
          '17:48',
          '18:18',
          '18:48',
          '19:18'
        ],
      },
      'station_2': {
        'name': '金建路',
        'times': [
          '06:51',
          '07:21',
          '07:51',
          '08:21',
          '08:51',
          '09:21',
          '09:51',
          '10:21',
          '10:51',
          '11:21',
          '11:51',
          '12:21',
          '12:51',
          '13:21',
          '13:51',
          '14:21',
          '14:51',
          '15:21',
          '15:51',
          '16:21',
          '16:51',
          '17:21',
          '17:51',
          '18:21',
          '18:51',
          '19:21'
        ],
      },
      'station_3': {
        'name': '重庆西站',
        'times': [
          '06:59',
          '07:29',
          '07:59',
          '08:29',
          '08:59',
          '09:29',
          '09:59',
          '10:29',
          '10:59',
          '11:29',
          '11:59',
          '12:29',
          '12:59',
          '13:29',
          '13:59',
          '14:29',
          '14:59',
          '15:29',
          '15:59',
          '16:29',
          '16:59',
          '17:29',
          '17:59',
          '18:29',
          '18:59',
          '19:29'
        ],
      },
      'station_4': {
        'name': '上桥',
        'times': [
          '07:03',
          '07:33',
          '08:03',
          '08:33',
          '09:03',
          '09:33',
          '10:03',
          '10:33',
          '11:03',
          '11:33',
          '12:03',
          '12:33',
          '13:03',
          '13:33',
          '14:03',
          '14:33',
          '15:03',
          '15:33',
          '16:03',
          '16:33',
          '17:03',
          '17:33',
          '18:03',
          '18:33',
          '19:03',
          '19:33'
        ],
      },
      'station_5': {
        'name': '重庆图书馆',
        'times': [
          '07:07',
          '07:37',
          '08:07',
          '08:37',
          '09:07',
          '09:37',
          '10:07',
          '10:37',
          '11:07',
          '11:37',
          '12:07',
          '12:37',
          '13:07',
          '13:37',
          '14:07',
          '14:37',
          '15:07',
          '15:37',
          '16:07',
          '16:37',
          '17:07',
          '17:37',
          '18:07',
          '18:37',
          '19:07',
          '19:37'
        ],
      },
      'station_6': {
        'name': '沙坪坝',
        'times': [
          '07:11',
          '07:41',
          '08:11',
          '08:41',
          '09:11',
          '09:41',
          '10:11',
          '10:41',
          '11:11',
          '11:41',
          '12:11',
          '12:41',
          '13:11',
          '13:41',
          '14:11',
          '14:41',
          '15:11',
          '15:41',
          '16:11',
          '16:41',
          '17:11',
          '17:41',
          '18:11',
          '18:41',
          '19:11',
          '19:41'
        ],
      },
      'station_7': {
        'name': '冉家坝',
        'times': [
          '07:20',
          '07:50',
          '08:20',
          '08:50',
          '09:20',
          '09:50',
          '10:20',
          '10:50',
          '11:20',
          '11:50',
          '12:20',
          '12:50',
          '13:20',
          '13:50',
          '14:20',
          '14:50',
          '15:20',
          '15:50',
          '16:20',
          '16:50',
          '17:20',
          '17:50',
          '18:20',
          '18:50',
          '19:20',
          '19:50'
        ],
      },
      'station_8': {
        'name': '民安大道',
        'times': [
          '07:25',
          '07:55',
          '08:25',
          '08:55',
          '09:25',
          '09:55',
          '10:25',
          '10:55',
          '11:25',
          '11:55',
          '12:25',
          '12:55',
          '13:25',
          '13:55',
          '14:25',
          '14:55',
          '15:25',
          '15:55',
          '16:25',
          '16:55',
          '17:25',
          '17:55',
          '18:25',
          '18:55',
          '19:25',
          '19:55'
        ],
      },
      'station_9': {
        'name': '重庆北站北广场',
        'times': [
          '07:28',
          '07:58',
          '08:28',
          '08:58',
          '09:28',
          '09:58',
          '10:28',
          '10:58',
          '11:28',
          '11:58',
          '12:28',
          '12:58',
          '13:28',
          '13:58',
          '14:28',
          '14:58',
          '15:28',
          '15:58',
          '16:28',
          '16:58',
          '17:28',
          '17:58',
          '18:28',
          '18:58',
          '19:28',
          '19:58'
        ],
      },
      'station_10': {
        'name': '头塘',
        'times': [
          '07:32',
          '08:02',
          '08:32',
          '09:02',
          '09:32',
          '10:02',
          '10:32',
          '11:02',
          '11:32',
          '12:02',
          '12:32',
          '13:02',
          '13:32',
          '14:02',
          '14:32',
          '15:02',
          '15:32',
          '16:02',
          '16:32',
          '17:02',
          '17:32',
          '18:02',
          '18:32',
          '19:02',
          '19:32',
          '20:02'
        ],
      },
      'station_11': {
        'name': '唐家沱',
        'times': [
          '07:44',
          '08:14',
          '08:44',
          '09:14',
          '09:44',
          '10:14',
          '10:44',
          '11:14',
          '11:44',
          '12:14',
          '12:44',
          '13:14',
          '13:44',
          '14:14',
          '14:44',
          '15:14',
          '15:44',
          '16:14',
          '16:44',
          '17:14',
          '17:44',
          '18:14',
          '18:44',
          '19:14',
          '19:44',
          '20:14'
        ],
      },
    },
  },

  onChange(e) {
    this.setData({
      value: e.detail.value,
    });
    wx.navigateTo({
      url: '../' + e.detail.value + '/' + e.detail.value,
    })
  },

  // 事件处理函数
  bindViewTap() {
    wx.navigateTo({
      url: '../logs/logs'
    })
  },
  onLoad() {
    let that = this
    that.startSetInter()
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {
    this.endSetInter()
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {
    this.endSetInter()
  },

  //微信小程序设置一个定时器
  startSetInter: function () {
    let that = this;
    let stationList = this.data.stations
    //将计时器赋值给setInter
    that.data.timer = setInterval(function () {
      let now = new Date();
      let h = now.getHours().toString()
      let m = now.getMinutes().toString()
      if (h < '10') {
        h = '0' + h
      }
      if (m < '10') {
        m = '0' + m
      }
      let nowString = h + ':' + m
      
      for (const station in stationList) {
        let sTimes = stationList[station].times
        //  console.log(station)
        sTimes.every(function (tt) {
          let item = that.data.stations[station]
          
          if (tt > nowString) {
            if (tt != '终到站' && tt != '暂未开通') {
              item.next = '下一趟:' + tt
            } else {
              item.next = tt
            }
            let nl = limit(tt, nowString)
            if (nl != '') {
              item.next_limit = '【' + nl + '】'
            }
            //                      console.log(tt)
            that.setData({
              [`stations.${station}`]: item,
            })
            return false
          } else {
            return true
          }
        })
      }
      //      console.log(that.data.stations)
    }, 1000);

    function limit(t, nowString) {
      if (t == '终到站' || t == '暂未开通') {
        return '';
      }
      let now = new Date();
      let t1 = '2006/12/23 ' + nowString + ':' + now.getSeconds().toString();
      let t2 = '2006/12/23 ' + t + ':00';
      let tt1 = new Date(t1);
      let tt2 = new Date(t2);
      return dateformat(parseInt(tt2 - tt1) / 1000);
    }

    function dateformat(micro_second) {
      let second = Math.floor(micro_second % 60);
      let minute = Math.floor((micro_second / 60) % 60);
      let hour = Math.floor(micro_second / 3600);
      if (hour < 0 || minute < 0 || second < 0) {
        return ""
      }
      return (hour < 10 ? '0' + hour : hour) + ":" + (minute < 10 ? '0' + minute : minute) + ":" + (second < 10 ? '0' + second : second);
    }
  },

  //微信小程序在页面卸载的时候删除定时器
  endSetInter: function () {
    var that = this;
    //清除计时器  即清除setInter
    clearInterval(that.data.timer)
  },

})